Revit 2024 API
FabricationConnectorInfo Class
 Fabrication connector information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class FabricationConnectorInfo : IDisposable
Visual Basic
Public Class FabricationConnectorInfo _
	Implements IDisposable
Visual C++
public ref class FabricationConnectorInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationConnectorInfo
See Also
FabricationConnectorInfo Members
Autodesk.Revit.DB Namespace